package task_4;

public class AbstractClass {
    /** Oracle: Абстрактні класи.
     * https://docs.oracle.com/javase/tutorial/java/IandI/abstract.html
     * Абстрактний клас в об'єктно-орієнтованому програмуванні – базовий клас, який не передбачає створення екземплярів.
     * Абстрактні класи на практиці реалізують один із принципів ООП – поліморфізм. Абстрактний клас може містити
     * (і не містити) абстрактні методи та властивості. Абстрактний метод не реалізується для класу, в якому описаний,
     * проте має бути реалізований для його неабстрактних нащадків. Абстрактні класи – найбільш загальні абстракції,
     * тобто мають найбільший обсяг і найменший зміст.
     * • Ключове слово abstract може використовуватися з класами та методами.
     * • Ключове слово abstract під час створення класу вказує, що клас призначений лише для використання як базовий клас для інших класів. Члени, які позначені як абстрактні або додані до абстрактного класу, мають бути реалізовані за допомогою класів, похідних від абстрактних
     * класів.
     * • Можливості абстрактних класів:
     * 1. Не можна створити екземпляр абстрактного класу.
     * 2. Абстрактні класи можуть містити як абстрактні, так і прості (неабстрактні) члени.
     * 3. Неабстрактний клас, що є похідним від абстрактного, має містити фактичні реалізації всіх
     * наслідуваних абстрактних методів і методів доступу.
     * • Можливості абстрактних методів:
     * 1. Абстрактний метод є неявним методом.
     * 2. Створення абстрактних методів допускається лише в абстрактних класах.
     * 3. Тіло абстрактного методу відсутнє; створення методу просто закінчується крапкою з комою,
     * після сигнатури ставити фігурні дужки {} не потрібно.
     * 4. Реалізація надається методом перевизначення override, що є членом неабстрактного класу.
     * • Абстрактний клас має надавати реалізацію для всіх членів інтерфейсу.
     * • Абстрактний клас, який реалізує інтерфейс, може зображати методи інтерфейсу в абстрактних
     * методах.
     * • Переваги використання абстрактних класів:
     * 1. Загальний код в одній реалізації у вигляді конкретних та абстрактних членів.
     * 2. Зміна значення полів або неабстрактних членів абстрактного класу призводить до відповідної
     * зміни у всіх його похідних класах.
     * 3. Наявність реалізації за замовчуванням.
     */
}
